---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsComponentConnection.Dispose
source: html/9348128e-3155-82e1-e29f-b69de26715b1.htm
---
# Autodesk.Revit.DB.Architecture.StairsComponentConnection.Dispose Method

Releases all resources used by the StairsComponentConnection

## Syntax (C#)
```csharp
public void Dispose()
```